dodb/docs/experiments/results/oci-a1-2ocpu-12g-zfs-real-sync/fio-sync.txt
** WARNING: connection is not using a post-quantum key exchange algorithm.
** This session may be vulnerable to "store now, decrypt later" attacks.
** The server may need to be upgraded. See https://openssh.com/pq.html
Last metadata expiration check: 2:44:52 ago on Fri 25 Sep 2026 08:01:11 AM GMT.
Dependencies resolved.
================================================================================
 Package             Arch      Version                Repository           Size
================================================================================
Installing:
 fio                 aarch64   3.35-1.el9             ol9_appstream       6.4 M
Installing dependencies:
 boost-iostreams     aarch64   1.75.0-13.el9_7        ol9_appstream        35 k
 libnbd              aarch64   1.20.3-4.el9           ol9_appstream       172 k
 librados2           aarch64   2:16.2.4-5.0.3.el9     ol9_appstream       3.2 M
 librbd1             aarch64   2:16.2.4-5.0.3.el9     ol9_appstream       2.7 M
 librdmacm           aarch64   61.0-2.el9             ol9_baseos_latest    77 k
Installing weak dependencies:
 fio-engine-http     aarch64   3.35-1.el9             ol9_appstream        16 k
 fio-engine-libaio   aarch64   3.35-1.el9             ol9_appstream        14 k
 fio-engine-nbd      aarch64   3.35-1.el9             ol9_appstream        13 k
 fio-engine-rados    aarch64   3.35-1.el9             ol9_appstream        14 k
 fio-engine-rbd      aarch64   3.35-1.el9             ol9_appstream        15 k
 fio-engine-rdma     aarch64   3.35-1.el9             ol9_appstream        19 k

Transaction Summary
================================================================================
Install  12 Packages

Total download size: 13 M
Installed size: 31 M
Downloading Packages:
(1/12): boost-iostreams-1.75.0-13.el9_7.aarch64 764 kB/s |  35 kB     00:00    
(2/12): librdmacm-61.0-2.el9.aarch64.rpm        1.5 MB/s |  77 kB     00:00    
(3/12): fio-engine-http-3.35-1.el9.aarch64.rpm  1.3 MB/s |  16 kB     00:00    
(4/12): fio-engine-libaio-3.35-1.el9.aarch64.rp 1.2 MB/s |  14 kB     00:00    
(5/12): fio-engine-rados-3.35-1.el9.aarch64.rpm 1.7 MB/s |  14 kB     00:00    
(6/12): fio-engine-nbd-3.35-1.el9.aarch64.rpm   927 kB/s |  13 kB     00:00    
(7/12): fio-engine-rbd-3.35-1.el9.aarch64.rpm   2.6 MB/s |  15 kB     00:00    
(8/12): fio-engine-rdma-3.35-1.el9.aarch64.rpm  3.4 MB/s |  19 kB     00:00    
(9/12): libnbd-1.20.3-4.el9.aarch64.rpm          18 MB/s | 172 kB     00:00    
(10/12): librados2-16.2.4-5.0.3.el9.aarch64.rpm  48 MB/s | 3.2 MB     00:00    
(11/12): librbd1-16.2.4-5.0.3.el9.aarch64.rpm    36 MB/s | 2.7 MB     00:00    
(12/12): fio-3.35-1.el9.aarch64.rpm              32 MB/s | 6.4 MB     00:00    
--------------------------------------------------------------------------------
Total                                            61 MB/s |  13 MB     00:00     
Running transaction check
Transaction check succeeded.
Running transaction test
Transaction test succeeded.
Running transaction
  Preparing        :                                                        1/1 
  Installing       : librdmacm-61.0-2.el9.aarch64                          1/12 
  Installing       : libnbd-1.20.3-4.el9.aarch64                           2/12 
  Installing       : boost-iostreams-1.75.0-13.el9_7.aarch64               3/12 
  Installing       : librados2-2:16.2.4-5.0.3.el9.aarch64                  4/12 
  Running scriptlet: librados2-2:16.2.4-5.0.3.el9.aarch64                  4/12 
  Installing       : librbd1-2:16.2.4-5.0.3.el9.aarch64                    5/12 
  Running scriptlet: librbd1-2:16.2.4-5.0.3.el9.aarch64                    5/12 
  Installing       : fio-engine-http-3.35-1.el9.aarch64                    6/12 
  Installing       : fio-engine-libaio-3.35-1.el9.aarch64                  7/12 
  Installing       : fio-engine-nbd-3.35-1.el9.aarch64                     8/12 
  Installing       : fio-engine-rados-3.35-1.el9.aarch64                   9/12 
  Installing       : fio-engine-rdma-3.35-1.el9.aarch64                   10/12 
  Installing       : fio-3.35-1.el9.aarch64                               11/12 
  Installing       : fio-engine-rbd-3.35-1.el9.aarch64                    12/12 
  Running scriptlet: fio-engine-rbd-3.35-1.el9.aarch64                    12/12 
  Verifying        : librdmacm-61.0-2.el9.aarch64                          1/12 
  Verifying        : boost-iostreams-1.75.0-13.el9_7.aarch64               2/12 
  Verifying        : fio-3.35-1.el9.aarch64                                3/12 
  Verifying        : fio-engine-http-3.35-1.el9.aarch64                    4/12 
  Verifying        : fio-engine-libaio-3.35-1.el9.aarch64                  5/12 
  Verifying        : fio-engine-nbd-3.35-1.el9.aarch64                     6/12 
  Verifying        : fio-engine-rados-3.35-1.el9.aarch64                   7/12 
  Verifying        : fio-engine-rbd-3.35-1.el9.aarch64                     8/12 
  Verifying        : fio-engine-rdma-3.35-1.el9.aarch64                    9/12 
  Verifying        : libnbd-1.20.3-4.el9.aarch64                          10/12 
  Verifying        : librados2-2:16.2.4-5.0.3.el9.aarch64                 11/12 
  Verifying        : librbd1-2:16.2.4-5.0.3.el9.aarch64                   12/12 

Installed:
  boost-iostreams-1.75.0-13.el9_7.aarch64  fio-3.35-1.el9.aarch64               
  fio-engine-http-3.35-1.el9.aarch64       fio-engine-libaio-3.35-1.el9.aarch64 
  fio-engine-nbd-3.35-1.el9.aarch64        fio-engine-rados-3.35-1.el9.aarch64  
  fio-engine-rbd-3.35-1.el9.aarch64        fio-engine-rdma-3.35-1.el9.aarch64   
  libnbd-1.20.3-4.el9.aarch64              librados2-2:16.2.4-5.0.3.el9.aarch64 
  librbd1-2:16.2.4-5.0.3.el9.aarch64       librdmacm-61.0-2.el9.aarch64         

Complete!
fio-3.35
TARGET        SOURCE       FSTYPE OPTIONS
/bench/zfs/db dodbbench/db zfs    rw,noatime,seclabel,xattr,noacl,casesensitive
zfs-sync-4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 process
zfs-sync-4k: Laying out IO file (1 file / 1024MiB)

zfs-sync-4k: (groupid=0, jobs=1): err= 0: pid=332115: Fri Sep 25 10:46:22 2026
  write: IOPS=1457, BW=5831KiB/s (5971kB/s)(85.4MiB/15001msec); 0 zone resets
    clat (usec): min=9, max=128, avg=15.79, stdev= 5.26
     lat (usec): min=9, max=129, avg=16.04, stdev= 5.29
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   12], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   15], 60.00th=[   15],
     | 70.00th=[   16], 80.00th=[   18], 90.00th=[   23], 95.00th=[   26],
     | 99.00th=[   34], 99.50th=[   41], 99.90th=[   71], 99.95th=[   87],
     | 99.99th=[  119]
   bw (  KiB/s): min= 4176, max= 6240, per=99.96%, avg=5829.79, stdev=505.17, samples=29
   iops        : min= 1044, max= 1560, avg=1457.45, stdev=126.29, samples=29
  lat (usec)   : 10=0.05%, 20=87.29%, 50=12.42%, 100=0.22%, 250=0.02%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=451, max=18011, avg=666.97, stdev=241.61
    sync percentiles (usec):
     |  1.00th=[  506],  5.00th=[  529], 10.00th=[  553], 20.00th=[  578],
     | 30.00th=[  594], 40.00th=[  619], 50.00th=[  635], 60.00th=[  660],
     | 70.00th=[  685], 80.00th=[  717], 90.00th=[  775], 95.00th=[  857],
     | 99.00th=[ 1352], 99.50th=[ 1647], 99.90th=[ 2540], 99.95th=[ 3097],
     | 99.99th=[12125]
  cpu          : usr=0.45%, sys=4.78%, ctx=21923, majf=0, minf=9
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21869,0,21869 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5831KiB/s (5971kB/s), 5831KiB/s-5831KiB/s (5971kB/s-5971kB/s), io=85.4MiB (89.6MB), run=15001-15001msec